Tekla.Structures.Drawing.DrawingHandler.MessageExecutionModeEnum
The message execution modes of Tekla Structures.
Remarks:
The message execution mode of Tekla Structures controls whether
messages are executed after each database operation or by an explicit
call to execute messages.
There may be some speed benefits if the BY_COMMIT mode is used when inserting
a lot of objects. The messages are then executed once after the objects have been inserted.

Tekla.Structures.Drawing.DrawingHandler.MessageExecutionModeEnum.INSTANT
Executes messages after each database operation. All objects
appear instantly on the screen when using the INSTANT mode.

Tekla.Structures.Drawing.DrawingHandler.MessageExecutionModeEnum.BY_COMMIT
Executes messages only when Drawing.CommitChanges() is called.